-- phpMyAdmin SQL Dump
-- version 4.7.7
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июл 14 2018 г., 18:11
-- Версия сервера: 5.7.20
-- Версия PHP: 7.2.0

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `freelancehunt`
--

-- --------------------------------------------------------

--
-- Структура таблицы `countries`
--

CREATE TABLE `countries` (
  `id` int(11) NOT NULL,
  `code` varchar(10) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `countries`
--

INSERT INTO `countries` (`id`, `code`, `name`) VALUES
(2, 'AU', 'Австралия'),
(3, 'AT', 'Австрия'),
(4, 'AZ', 'Азербайджан'),
(5, 'AX', 'Аландские о-ва'),
(6, 'AL', 'Албания'),
(7, 'DZ', 'Алжир'),
(8, 'AS', 'Американское Самоа'),
(9, 'AI', 'Ангилья'),
(10, 'AO', 'Ангола'),
(11, 'AD', 'Андорра'),
(12, 'AQ', 'Антарктида'),
(13, 'AG', 'Антигуа и Барбуда'),
(14, 'AR', 'Аргентина'),
(15, 'AM', 'Армения'),
(16, 'AW', 'Аруба'),
(17, 'AF', 'Афганистан'),
(18, 'BS', 'Багамские о-ва'),
(19, 'BD', 'Бангладеш'),
(20, 'BB', 'Барбадос'),
(21, 'BH', 'Бахрейн'),
(22, 'BY', 'Беларусь'),
(23, 'BZ', 'Белиз'),
(24, 'BE', 'Бельгия'),
(25, 'BJ', 'Бенин'),
(26, 'BM', 'Бермудские о-ва'),
(27, 'BG', 'Болгария'),
(28, 'BO', 'Боливия'),
(29, 'BQ', 'Бонэйр, Синт-Эстатиус и Саба'),
(30, 'BA', 'Босния и Герцеговина'),
(31, 'BW', 'Ботсвана'),
(32, 'BR', 'Бразилия'),
(33, 'IO', 'Британская территория в Индийском океане'),
(34, 'BN', 'Бруней-Даруссалам'),
(35, 'BF', 'Буркина-Фасо'),
(36, 'BI', 'Бурунди'),
(37, 'BT', 'Бутан'),
(38, 'VU', 'Вануату'),
(39, 'VA', 'Ватикан'),
(40, 'GB', 'Великобритания'),
(41, 'HU', 'Венгрия'),
(42, 'VE', 'Венесуэла'),
(43, 'VG', 'Виргинские о-ва (Британские)'),
(44, 'VI', 'Виргинские о-ва (США)'),
(45, 'UM', 'Внешние малые о-ва (США)'),
(46, 'TL', 'Восточный Тимор'),
(47, 'VN', 'Вьетнам'),
(48, 'GA', 'Габон'),
(49, 'HT', 'Гаити'),
(50, 'GY', 'Гайана'),
(51, 'GM', 'Гамбия'),
(52, 'GH', 'Гана'),
(53, 'GP', 'Гваделупа'),
(54, 'GT', 'Гватемала'),
(55, 'GN', 'Гвинея'),
(56, 'GW', 'Гвинея-Бисау'),
(57, 'DE', 'Германия'),
(58, 'GG', 'Гернси'),
(59, 'GI', 'Гибралтар'),
(60, 'HN', 'Гондурас'),
(61, 'HK', 'Гонконг (особый район)'),
(62, 'GD', 'Гренада'),
(63, 'GL', 'Гренландия'),
(64, 'GR', 'Греция'),
(65, 'GE', 'Грузия'),
(66, 'GU', 'Гуам'),
(67, 'DK', 'Дания'),
(68, 'JE', 'Джерси'),
(69, 'DJ', 'Джибути'),
(70, 'DG', 'Диего-Гарсия'),
(71, 'DM', 'Доминика'),
(72, 'DO', 'Доминиканская Республика'),
(73, 'EG', 'Египет'),
(74, 'ZM', 'Замбия'),
(75, 'EH', 'Западная Сахара'),
(76, 'ZW', 'Зимбабве'),
(77, 'IL', 'Израиль'),
(78, 'IN', 'Индия'),
(79, 'ID', 'Индонезия'),
(80, 'JO', 'Иордания'),
(81, 'IQ', 'Ирак'),
(82, 'IR', 'Иран'),
(83, 'IE', 'Ирландия'),
(84, 'IS', 'Исландия'),
(85, 'ES', 'Испания'),
(86, 'IT', 'Италия'),
(87, 'YE', 'Йемен'),
(88, 'CV', 'Кабо-Верде'),
(89, 'KZ', 'Казахстан'),
(90, 'KY', 'Каймановы о-ва'),
(91, 'KH', 'Камбоджа'),
(92, 'CM', 'Камерун'),
(93, 'CA', 'Канада'),
(94, 'IC', 'Канарские о-ва'),
(95, 'QA', 'Катар'),
(96, 'KE', 'Кения'),
(97, 'CY', 'Кипр'),
(98, 'KG', 'Киргизия'),
(99, 'KI', 'Кирибати'),
(100, 'CN', 'Китай'),
(101, 'KP', 'КНДР'),
(102, 'CC', 'Кокосовые о-ва'),
(103, 'CO', 'Колумбия'),
(104, 'KM', 'Коморские о-ва'),
(105, 'CG', 'Конго - Браззавиль'),
(106, 'CD', 'Конго - Киншаса'),
(107, 'XK', 'Косово'),
(108, 'CR', 'Коста-Рика'),
(109, 'CI', 'Кот-д’Ивуар'),
(110, 'CU', 'Куба'),
(111, 'KW', 'Кувейт'),
(112, 'CW', 'Кюрасао'),
(113, 'LA', 'Лаос'),
(114, 'LV', 'Латвия'),
(115, 'LS', 'Лесото'),
(116, 'LR', 'Либерия'),
(117, 'LB', 'Ливан'),
(118, 'LY', 'Ливия'),
(119, 'LT', 'Литва'),
(120, 'LI', 'Лихтенштейн'),
(121, 'LU', 'Люксембург'),
(122, 'MU', 'Маврикий'),
(123, 'MR', 'Мавритания'),
(124, 'MG', 'Мадагаскар'),
(125, 'YT', 'Майотта'),
(126, 'MO', 'Макао (особый район)'),
(127, 'MK', 'Македония'),
(128, 'MW', 'Малави'),
(129, 'MY', 'Малайзия'),
(130, 'ML', 'Мали'),
(131, 'MV', 'Мальдивские о-ва'),
(132, 'MT', 'Мальта'),
(133, 'MA', 'Марокко'),
(134, 'MQ', 'Мартиника'),
(135, 'MH', 'Маршалловы о-ва'),
(136, 'MX', 'Мексика'),
(137, 'MZ', 'Мозамбик'),
(138, 'MD', 'Молдова'),
(139, 'MC', 'Монако'),
(140, 'MN', 'Монголия'),
(141, 'MS', 'Монтсеррат'),
(142, 'MM', 'Мьянма (Бирма)'),
(143, 'NA', 'Намибия'),
(144, 'NR', 'Науру'),
(145, 'NP', 'Непал'),
(146, 'NE', 'Нигер'),
(147, 'NG', 'Нигерия'),
(148, 'NL', 'Голландия'),
(149, 'NI', 'Никарагуа'),
(150, 'NU', 'Ниуэ'),
(151, 'NZ', 'Новая Зеландия'),
(152, 'NC', 'Новая Каледония'),
(153, 'NO', 'Норвегия'),
(154, 'AC', 'о-в Вознесения'),
(155, 'IM', 'О-в Мэн'),
(156, 'NF', 'о-в Норфолк'),
(157, 'CX', 'о-в Рождества'),
(158, 'SH', 'О-в Св. Елены'),
(159, 'CK', 'о-ва Кука'),
(160, 'TC', 'О-ва Тёркс и Кайкос'),
(161, 'AE', 'ОАЭ'),
(162, 'OM', 'Оман'),
(163, 'PK', 'Пакистан'),
(164, 'PW', 'Палау'),
(165, 'PS', 'Палестинские территории'),
(166, 'PA', 'Панама'),
(167, 'PG', 'Папуа – Новая Гвинея'),
(168, 'PY', 'Парагвай'),
(169, 'PE', 'Перу'),
(170, 'PN', 'Питкэрн'),
(171, 'PL', 'Польша'),
(172, 'PT', 'Португалия'),
(173, 'PR', 'Пуэрто-Рико'),
(174, 'KR', 'Республика Корея'),
(175, 'RE', 'Реюньон'),
(176, 'RU', 'Россия'),
(177, 'RW', 'Руанда'),
(178, 'RO', 'Румыния'),
(179, 'SV', 'Сальвадор'),
(180, 'WS', 'Самоа'),
(181, 'SM', 'Сан-Марино'),
(182, 'ST', 'Сан-Томе и Принсипи'),
(183, 'SA', 'Саудовская Аравия'),
(184, 'SZ', 'Свазиленд'),
(185, 'MP', 'Северные Марианские о-ва'),
(186, 'SC', 'Сейшельские о-ва'),
(187, 'BL', 'Сен-Бартельми'),
(188, 'MF', 'Сен-Мартен'),
(189, 'PM', 'Сен-Пьер и Микелон'),
(190, 'SN', 'Сенегал'),
(191, 'VC', 'Сент-Винсент и Гренадины'),
(192, 'KN', 'Сент-Китс и Невис'),
(193, 'LC', 'Сент-Люсия'),
(194, 'RS', 'Сербия'),
(195, 'EA', 'Сеута и Мелилья'),
(196, 'SG', 'Сингапур'),
(197, 'SX', 'Синт-Мартен'),
(198, 'SY', 'Сирия'),
(199, 'SK', 'Словакия'),
(200, 'SI', 'Словения'),
(201, 'US', 'США'),
(202, 'SB', 'Соломоновы о-ва'),
(203, 'SO', 'Сомали'),
(204, 'SD', 'Судан'),
(205, 'SR', 'Суринам'),
(206, 'SL', 'Сьерра-Леоне'),
(207, 'TJ', 'Таджикистан'),
(208, 'TH', 'Таиланд'),
(209, 'TW', 'Тайвань'),
(210, 'TZ', 'Танзания'),
(211, 'TG', 'Того'),
(212, 'TK', 'Токелау'),
(213, 'TO', 'Тонга'),
(214, 'TT', 'Тринидад и Тобаго'),
(215, 'TA', 'Тристан-да-Кунья'),
(216, 'TV', 'Тувалу'),
(217, 'TN', 'Тунис'),
(218, 'TM', 'Туркменистан'),
(219, 'TR', 'Турция'),
(220, 'UG', 'Уганда'),
(221, 'UZ', 'Узбекистан'),
(222, 'UA', 'Украина'),
(223, 'WF', 'Уоллис и Футуна'),
(224, 'UY', 'Уругвай'),
(225, 'FO', 'Фарерские о-ва'),
(226, 'FM', 'Федеративные Штаты Микронезии'),
(227, 'FJ', 'Фиджи'),
(228, 'PH', 'Филиппины'),
(229, 'FI', 'Финляндия'),
(230, 'FK', 'Фолклендские о-ва'),
(231, 'FR', 'Франция'),
(232, 'GF', 'Французская Гвиана'),
(233, 'PF', 'Французская Полинезия'),
(234, 'TF', 'Французские Южные Территории'),
(235, 'HR', 'Хорватия'),
(236, 'CF', 'ЦАР'),
(237, 'TD', 'Чад'),
(238, 'ME', 'Черногория'),
(239, 'CZ', 'Чехия'),
(240, 'CL', 'Чили'),
(241, 'CH', 'Швейцария'),
(242, 'SE', 'Швеция'),
(243, 'SJ', 'Шпицберген и Ян-Майен'),
(244, 'LK', 'Шри-Ланка'),
(245, 'EC', 'Эквадор'),
(246, 'GQ', 'Экваториальная Гвинея'),
(247, 'ER', 'Эритрея'),
(248, 'EE', 'Эстония'),
(249, 'ET', 'Эфиопия'),
(250, 'ZA', 'ЮАР'),
(251, 'GS', 'Южная Георгия и Южные Сандвичевы о-ва'),
(252, 'SS', 'Южный Судан'),
(253, 'JM', 'Ямайка'),
(254, 'JP', 'Япония');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `home_country` int(11) NOT NULL,
  `rating` int(11) NOT NULL DEFAULT '0',
  `is_active` smallint(1) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `users_check_in`
--

CREATE TABLE `users_check_in` (
  `id` int(11) NOT NULL,
  `user` int(11) NOT NULL,
  `ip` varchar(100) NOT NULL,
  `country` int(11) NOT NULL,
  `date` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;


--
-- Индексы таблицы `countries`
--
ALTER TABLE `countries`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uniq_name` (`name`),
  ADD KEY `users_country` (`home_country`);

--
-- Индексы таблицы `users_check_in`
--
ALTER TABLE `users_check_in`
  ADD PRIMARY KEY (`id`),
  ADD KEY `user_key` (`user`),
  ADD KEY `users_country_check_id` (`country`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `countries`
--
ALTER TABLE `countries`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=255;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=92;

--
-- AUTO_INCREMENT для таблицы `users_check_in`
--
ALTER TABLE `users_check_in`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=172;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `users`
--
ALTER TABLE `users`
  ADD CONSTRAINT `users_country` FOREIGN KEY (`home_country`) REFERENCES `countries` (`id`);

--
-- Ограничения внешнего ключа таблицы `users_check_in`
--
ALTER TABLE `users_check_in`
  ADD CONSTRAINT `user_key` FOREIGN KEY (`user`) REFERENCES `users` (`id`),
  ADD CONSTRAINT `users_country_check_id` FOREIGN KEY (`country`) REFERENCES `countries` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
